{
  "header.home": "home",
  "header.projects": "projects",
  "header.contact": "contact",

  "intro.greeting": "Hi, I'm Guilherme Pereira",
  "intro.intro": "Fullstack Developer from Brazil 🇧🇷",
  "intro.about_me": "I am a fullstack developer with experience in Delphi and Java, focused on desktop and web systems. Currently, I enjoy turning ideas into functional and efficient applications, whether by creating APIs with Spring Boot or modern interfaces with React!",
  "intro.more_1": "I have been developing and maintaining desktop applications and web systems for approximately 3 years, always striving for improvement through courses. My most recent experience was in agribusiness systems, where I implemented tools to optimize internal processes, such as automating manual tests and error reporting in Jenkins, improving issue detection efficiency.",
  "intro.more_2": "I have also led the development of management systems and database migrations to ensure compatibility and integrity. During this period, I was responsible for handling over 100 support tickets, always aiming for quick and effective solutions for clients.",
  "intro.more_3": "I am currently pursuing a degree in Software Analysis and Development to further expand my technical knowledge. I am always looking for new challenges to apply my skills and contribute to the success of the projects and companies I collaborate with.",

  "intro.read_more": "Read more",
  "intro.read_less": "Read less",


  "contact.resume": "Resume",
  "contact.resume_file_name": "Fullstack Developer Guilherme Pereira.pdf",

  "work.heading": "Work",
  
  "work.agro1.company_name": "Agro1 - Solutions for Agribusiness Management",
  "work.agro1.job_title": "Delphi Developer",
  "work.agro1.bullet_point_1": "Developed and maintained desktop applications for agribusiness, covering multidisciplinary modules such as financial control, inventory, invoicing, and more.",
  "work.agro1.bullet_point_2": "Developed an internal tool to automate QA team’s manual testing, reducing test preparation time from 40 minutes to 10 minutes.",
  "work.agro1.bullet_point_3": "Configured and implemented error reporting in Jenkins during the development stage, increasing efficiency in issue detection.",
  
  "work.system.company_name": "System Management Systems",
  "work.system.job_title": "Delphi and Java Developer",
  "work.system.bullet_point_1": "Developed and maintained Delphi desktop applications and Java web systems, focusing on public systems and HR.",
  "work.system.bullet_point_2": "Led the development of a financial system that simulated all retirement modalities for approximately 2,000 employees of Erechim City Hall.",
  "work.system.bullet_point_3": "Migrated databases for 5 clients, ensuring version compatibility and data integrity.",
  
  "education.heading": "Education",

  "education.uri.course_name": "Bachelor's in Software Analysis and Development",
  "education.uri.instituition_name": "URI Erechim (Integrated Regional University of Alto Uruguai and the Missions)",

  "education.ifrs.course_name": "Technical Course in Information Technology",
  "education.ifrs.instituition_name": "IFRS Erechim (Federal Institute of Rio Grande do Sul)",

  "projects.heading": "Projects",
  "projects.view_more": "view more",
  "projects.source": "Source",
  "projects.try_it_out": "Try it out",

  "project.url_shortener.name": "URL Shortener",
  "project.url_shortener.description": "A lightweight and efficient URL shortener built with Java Spring for the backend and Vite with TypeScript for the frontend.",

  "project.chess.name": "Spring Chess",
  "project.chess.description": "Spring Chess is a work-in-progress chess game with its backend built with Java Spring, and a frontend written in Next.js and React. Integrated with Stockfish.",

  "project.cobblemon.name": "Cobblemon (Colaborator)",
  "project.cobblemon.description": "Minecraft mod with around <strong>10 million downloads</strong>, written in Kotlin and available for Fabric and NeoForge, combining Pokémon-inspired gameplay with Minecraft mechanics.",

  "project.image_processing.name": "Image Processing",
  "project.image_processing.description": "This project offers a variety of image filters, with a focus on code readability to help learners understand and code different filtering techniques.",

  "project.webfishing.name": "WEBFISHING",
  "project.webfishing.description": "A website that lists all the fishes, baits, and lures available in the PC game WEBFISHING, featuring a UI styled to match the game's design.",

  "project.med_summaries.name": "Med Summaries",
  "project.med_summaries.description": "Platform focused on summarizing medical content, designed to facilitate studying. Growing project with over 100 registered interested users.",

  "project.portfolio.name": "Portfolio",
  "project.portfolio.description": "The very portfolio you're looking at right now!",

  "technology.java": "Java",
  "technology.spring": "Spring",
  "technology.typescript": "Typescript",
  "technology.vite": "Vite",
  "technology.tailwind": "Tailwind",
  "technology.aws": "Aws",
  "technology.kotlin": "Kotlin",
  "technology.react": "React",
  "technology.express": "Express",
  "technology.postgre": "PostgreSQL",
  "technology.next": "Next.js",  
  "technology.firebase": "Firebase",
  "technology.stripe": "Stripe",
  "technology.open_source": "Open Source",

  "contact.heading": "Contact me",
  "contact.send_message": "Send Message",
  "contact.loading": "Loading...",
  "contact.thanks": "Thank you for your message!",
  "contact.error": "An error occurred, please try again later.",

  "contact.placeholder.name": "Name",
  "contact.placeholder.email": "Email",
  "contact.placeholder.message": "Leave feedback about the site, send job opportunities or just say hello!"
}